Update class processor visuals and class content
